-- hr 계정, group by, join, sub query 연습

-- 1. 직원 이름(first/last)과 부서이름 출력

-- 2. 위 결과에서 부서번호가 없는 직원도 출력

-- 3. 직원 이름과 직책이름(job_title)을 출력

-- 4. 직원 이름과 그 직원이 근무하는 도시 이름(city)를 출력

-- 5. 위 결과에서 근무하는 도시를 알 수 없는 직원도 출력

-- 6. 2008년에 입사한 직원들의 이름을 출력

-- 7. 2008년에 입사한 직원들의 부서이름, 부서별 인원수 출력

-- 8. 2008년에 입사한 직원들의 부서이름, 부서별 인원수 출력
-- 단, 부서별 인원수가 5명 이상인 경우만 출력.

-- 9. 부서번호, 부서별 급여 평균을 출력

-- 10. 부서별 급여 평균이 최대인 부서의 부서번호, 급여 평균을 출력

-- 11. 부서별 급여 평균이 최대인 부서의 부서이름, 급여 평균을 출력

-- 12. 사번, 국가이름, 급여를 출력

-- 13. 국가이름, 국가별 급여 합계을 출력

-- 14. 사번, 직책이름, 합계를 출력

-- 15. 직책 이름, 직책별 급여 합계을 출력

-- 16. 국가이름, 직책이름, 국가별 직책별 급여 합계을 출력

-- 17. 국가이름, 직책이름, 국가별 직책별 급여 합계을 출력.
-- 미국에서, 국가별 직책별 급여 합계가 50,000 이상인 레코드만 출력.
